"""
Скрипт для преобразования таблицы из широкого формата (wide) в плоский (flat).

Входные данные: Excel файл со структурой:
- Заголовок 1: Магазин 1, Магазин 2, ..., Магазин 20
- Заголовок 2: Число чеков, Количество в чеке, Сумма в чеке, Наценка продажи в чеке (для каждого магазина)
- Данные: Год → Месяц → Товар + Тип → значения по магазинам

Выходные данные: Плоская таблица с колонками:
Год, Месяц, Товар, Тип, Магазин, Число чеков, Количество в чеке, Сумма в чеке, Наценка продажи в чеке
"""

import pandas as pd
import numpy as np
from pathlib import Path


def read_wide_table(file_path: str, sheet_name: str = 0) -> pd.DataFrame:
    """
    Читает таблицу с мультиуровневыми заголовками.

    Args:
        file_path: путь к Excel файлу
        sheet_name: название или индекс листа

    Returns:
        DataFrame с исходными данными
    """
    # Читаем с двумя строками заголовка
    df = pd.read_excel(file_path, sheet_name=sheet_name, header=[0, 1])
    return df


def parse_headers(df: pd.DataFrame) -> tuple[list, list]:
    """
    Парсит мультиуровневые заголовки.

    Returns:
        (список магазинов, список метрик)
    """
    # Заголовки - это MultiIndex с двумя уровнями
    # Уровень 0: Магазин 1, Магазин 2, ...
    # Уровень 1: Число чеков, Количество в чеке, ...

    stores = []
    metrics = []

    for col in df.columns:
        store_name = col[0] if not pd.isna(col[0]) and 'Unnamed' not in str(col[0]) else None
        metric_name = col[1] if not pd.isna(col[1]) and 'Unnamed' not in str(col[1]) else None

        if store_name and store_name not in stores:
            stores.append(store_name)
        if metric_name and metric_name not in metrics:
            metrics.append(metric_name)

    return stores, metrics


def transform_to_flat(df: pd.DataFrame, input_file: str) -> pd.DataFrame:
    """
    Преобразует широкую таблицу в плоскую.

    Args:
        df: исходная таблица с мультиуровневыми заголовками
        input_file: путь к входному файлу (для логирования)

    Returns:
        Плоская таблица
    """
    print(f"📊 Обработка файла: {input_file}")
    print(f"   Размер исходной таблицы: {df.shape}")

    # Получаем список магазинов и метрик
    stores, metrics = parse_headers(df)
    print(f"   Найдено магазинов: {len(stores)}")
    print(f"   Найдено метрик: {len(metrics)}")
    print(f"   Метрики: {metrics}")

    # Первая колонка - это индекс (Название строк / Тип)
    # Берем первую колонку как индекс
    index_col = df.columns[0]
    df_index = df[index_col].copy()

    # Список для накопления результатов
    result_rows = []

    # Текущий год и месяц (для парсинга иерархии)
    current_year = None
    current_month = None

    # Проходим по всем строкам
    for idx, row in df.iterrows():
        # Получаем значение индексной колонки
        index_value = df_index.iloc[idx]

        # Пропускаем NaN строки
        if pd.isna(index_value):
            continue

        index_str = str(index_value).strip()

        # Проверяем, это год?
        if index_str.isdigit() and len(index_str) == 4:
            current_year = int(index_str)
            current_month = None
            continue

        # Проверяем, это месяц?
        months_ru = [
            "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь",
            "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"
        ]
        if index_str in months_ru:
            current_month = index_str
            continue

        # Иначе это строка с товаром
        # Парсим товар и тип (разделены табуляцией или несколькими пробелами)
        parts = index_str.split('\t')
        if len(parts) == 1:
            # Попробуем разделить по двум или более пробелам
            parts = [p.strip() for p in index_str.split('  ') if p.strip()]

        if len(parts) >= 2:
            tovar = parts[0].strip()
            tip = parts[1].strip()
        else:
            # Если не получилось распарсить, пропускаем
            print(f"⚠️  Не удалось распарсить строку: {index_str}")
            continue

        # Проверяем, что год и месяц определены
        if current_year is None or current_month is None:
            continue

        # Извлекаем данные для каждого магазина
        for store in stores:
            row_data = {
                'Год': current_year,
                'Месяц': current_month,
                'Товар': tovar,
                'Тип': tip,
                'Магазин': store
            }

            # Извлекаем значения метрик для этого магазина
            for metric in metrics:
                try:
                    # Ищем колонку (store, metric)
                    value = row[(store, metric)]
                    row_data[metric] = value if not pd.isna(value) else 0
                except KeyError:
                    row_data[metric] = 0

            result_rows.append(row_data)

    # Создаём итоговый DataFrame
    df_flat = pd.DataFrame(result_rows)

    print(f"✅ Преобразование завершено!")
    print(f"   Размер плоской таблицы: {df_flat.shape}")
    print(f"   Колонки: {list(df_flat.columns)}")

    return df_flat


def validate_flat_table(df: pd.DataFrame) -> bool:
    """
    Валидация плоской таблицы.

    Args:
        df: плоская таблица

    Returns:
        True если валидация прошла успешно
    """
    required_columns = [
        'Год', 'Месяц', 'Товар', 'Тип', 'Магазин',
        'Число чеков', 'Количество в чеке', 'Сумма в чеке', 'Наценка продажи в чеке'
    ]

    # Проверяем наличие всех колонок
    missing_cols = [col for col in required_columns if col not in df.columns]
    if missing_cols:
        print(f"❌ Отсутствуют колонки: {missing_cols}")
        return False

    # Проверяем наличие данных
    if df.empty:
        print("❌ Таблица пустая!")
        return False

    # Проверяем наличие NaN в критичных колонках
    critical_cols = ['Год', 'Месяц', 'Товар', 'Тип', 'Магазин']
    for col in critical_cols:
        if df[col].isna().any():
            print(f"❌ Найдены пустые значения в колонке: {col}")
            return False

    # Статистика
    print("\n📊 Статистика плоской таблицы:")
    print(f"   Строк: {len(df):,}")
    print(f"   Уникальных годов: {df['Год'].nunique()}")
    print(f"   Уникальных месяцев: {df['Месяц'].nunique()}")
    print(f"   Уникальных товаров: {df['Товар'].nunique()}")
    print(f"   Уникальных магазинов: {df['Магазин'].nunique()}")

    return True


def process_file(input_file: str, output_file: str, sheet_name: str = 0) -> bool:
    """
    Основная функция обработки файла.

    Args:
        input_file: путь к входному Excel файлу
        output_file: путь к выходному Excel файлу
        sheet_name: название или индекс листа

    Returns:
        True если обработка прошла успешно
    """
    try:
        # Проверяем существование входного файла
        if not Path(input_file).exists():
            print(f"❌ Файл не найден: {input_file}")
            return False

        print(f"\n{'='*80}")
        print("🔄 ПРЕОБРАЗОВАНИЕ ТАБЛИЦЫ: WIDE → FLAT")
        print(f"{'='*80}\n")

        # Читаем файл
        df_wide = read_wide_table(input_file, sheet_name)

        # Преобразуем в плоский формат
        df_flat = transform_to_flat(df_wide, input_file)

        # Валидируем результат
        if not validate_flat_table(df_flat):
            print("❌ Валидация не прошла!")
            return False

        # Сохраняем результат
        print(f"\n💾 Сохранение результата в: {output_file}")
        df_flat.to_excel(output_file, index=False)
        print("✅ Файл успешно сохранён!")

        # Выводим превью
        print("\n📋 Превью первых 10 строк:")
        print(df_flat.head(10).to_string())

        return True

    except Exception as e:
        print(f"❌ Ошибка при обработке: {e}")
        import traceback
        traceback.print_exc()
        return False


if __name__ == "__main__":
    # Параметры по умолчанию
    INPUT_FILE = "raw_data.xlsx"  # Исходный файл в широком формате
    OUTPUT_FILE = "final_flat_clean.xlsx"  # Результат в плоском формате
    SHEET_NAME = 0  # Первый лист

    # Запускаем обработку
    success = process_file(INPUT_FILE, OUTPUT_FILE, SHEET_NAME)

    if success:
        print(f"\n{'='*80}")
        print("✅ ОБРАБОТКА ЗАВЕРШЕНА УСПЕШНО!")
        print(f"{'='*80}\n")
    else:
        print(f"\n{'='*80}")
        print("❌ ОБРАБОТКА ЗАВЕРШИЛАСЬ С ОШИБКАМИ")
        print(f"{'='*80}\n")
